Revit 2022 API
AnalyticalModel.Enable Method
 Enables or disables Analytical Model, if the Element allows a one-operation Analytical Model toggle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public void Enable(
	bool enable
)
Visual Basic
Public Sub Enable ( _
	enable As Boolean _
)
Visual C++
public:
void Enable(
	bool enable
)
Parameters
enable
Type: System.Boolean
 Enable (true) or disable (false) Analytical Model.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace